Repository: MjavadH/Advanced-Lock
Catalog: Advanced Lock/Translations/*.resx
Languages: fa, ja

source: Add
ja: 追加

source: Application description
fa: رمزنگاری و رمزگشایی هرچیزی
ja: あらゆるものを暗号化および復号化する

source: Cancel
fa: انصراف
ja: キャンセル

source: Change languages
fa: تغییر زبان
ja: 言語を変更する

source: Check
fa: بررسی
ja: チェック

source: Checked configuration and fixed problems
fa: پیکربندی برسی شد و تمامی مشکلات رفع شد
ja: 構成がチェックされ、すべての問題が修正されました

source: Configuration
ja: 構成

source: Dark Mode
fa: حالت تاریک
ja: ダークモード

source: Decrypt
fa: رمزگشایی
ja: 復号化

source: Decryption File
fa: رمزگشایی فایل
ja: 復号化ファイル

source: Decryption Folder
fa: رمزگشایی پوشه
ja: 復号化フォルダー

source: Decryption Text
fa: رمزگشایی متن
ja: 復号化テキスト

source: Delete All History
fa: حذف تمام تاریخچه ها
ja: すべての履歴を削除

source: Delete Row
fa: حذف ردیف
ja: 行を削除する

source: Developer Description
fa: طراح و توسعه دهنده: MjavadH این یک نرم‌افزار متن باز است گیت هاب:
ja: デザイナー兼開発者: MjavadH これはオープンソース ソフトウェアです GitHub:

source: Enable password
fa: فعال کردن گذرواژه
ja: パスワードを有効にする

source: Encrypt
fa: رمزنگاری
ja: 暗号化する

source: Encryption File
fa: رمزنگاری فایل
ja: 暗号化ファイル

source: Encryption Folder
fa: رمزنگاری پوشه
ja: 暗号化フォルダー

source: Encryption Text
fa: رمزنگاری متن
ja: 暗号化テキスト

source: Enter password
fa: گذرواژه وارد کنید
ja: パスワードを入力してください

source: Error
fa: خطایی رخ داد
ja: 誤り

source: Error password or your choice
fa: خطا: کادر های 'انتخاب شما' یا 'گذرواژه' خالی است
ja: エラー: 「選択したもの」または「パスワード」フィールドが空です

source: Example Notification
fa: تست اعلان
ja: 通知例

source: Export is done
fa: دیتا ها ذخیره شدند
ja: エクスポートが完了しました

source: File
fa: فایل
ja: ファイル

source: Folder
fa: پوشه
ja: フォルダ

source: Import is done
fa: دیتا ها بارگزاری شدند
ja: インポートが完了しました

source: in iran
fa: در ایران
ja: イランで

source: Incorect Password
fa: گذرواژه اشتباه است!
ja: パスワードが間違っています!

source: Information
fa: اطلاعات
ja: 情報

source: Light Mode
fa: حالت روز
ja: ライトモード

source: Load History
fa: بارگذاری تاریخچه
ja: 履歴のロード

source: Made with
fa: ساخته شده با
ja: で作った

source: Menu
fa: منو
ja: メニュー

source: Not found file
fa: فایل پیدا نشد
ja: ファイルが見つかりません

source: Password
fa: گذرواژه
ja: パスワード

source: password is enable
fa: گذرواژه فعال شد
ja: パスワードは有効です

source: Play sound
fa: پخش صدا
ja: 音を出す

source: Refresh
fa: تازه کردن داده ها
ja: リフレッシュ

source: Remove
ja: 削除

source: Restart app to chenge language
fa: برنامه را بسته و مجدد باز نمایید تا زبان تغییر کند
ja: 言語を変更するにはアプリケーションを再起動してください

source: Restart app to chenge theme
fa: برنامه را بسته و مجدد باز نمایید تا تغییر حالت به درستی انجام گیرد
ja: アプリケーションを再起動してテーマを変更する

source: Result
fa: نتیجه
ja: 結果

source: Result text copyed
fa: نتیجه کپی شد
ja: 結果テキストがコピーされました

source: Result text empty
fa: نتیجه خالی است
ja: 結果のテキストが空です

source: Save History
fa: ذخیره تاریخچه
ja: 履歴の保存

source: Select your Theme
fa: تم مورد نظر خود را انتخاب کنید
ja: テーマを選択してください

source: Settings
fa: تنظیمات
ja: 設定

source: Show notification
fa: نمایش اعلان
ja: 通知を表示する

source: Submit
fa: ثبت
ja: 送信

source: Text
fa: متن
ja: 文章

source: There is no problem in configuring
fa: مشکلی در پیکربندی نرم‌افزار وجود ندارد
ja: ソフトウェアの設定には問題ありません

source: your choice
fa: انتخاب شما
ja: あなたの選択

source: Check configuration
fa: بررسی پیکربندی

source: OK
fa: تایید
